{
  "cname": "霍格沃茨",
  "name": "Hogwarts School of Witchcraft and Wizardry",
  "image": "hogwarts.jpg",
  "intro": [
    "建立于公元990年前后的霍格沃茨是欧洲的魔法学校之一。",
    "有魔法能力的孩子在出生时就被登记下来，他们会在11岁时收到猫头鹰寄来的录取通知书。",
    "学校采用七年学制，所有学生在霍格沃茨的求学期间需要寄宿。圣诞节期间，学生可离校返家，也可选择留校过节；三年级以上学生经监护人签字同意后可以在周末的时候前往霍格莫德村；暑假期间所有学生必须离开学校。",
    "霍格沃茨共分为四个学院，分别是格兰芬多（Gryffindor）、赫奇帕奇（Hufflepuff）、拉文克劳（Ravenclaw）和斯莱特林（Slytherin），四个学院皆有其代表颜色与动物。新生入学第一件事情就是戴上分院帽（Sorting Hat），分院帽会根据你的性格和品质来判断你该属于哪一个学院。"
  ],
  "subjects": [
    {
      "title": "变形术",
      "content": "变形术是一门改变对象形状或外观的魔法分支，而这也是本门课程所介绍的内容。变形学是一门基于理论的科目，教授的咒语包括转换咒（给对象的一部分变形，比如让人长出兔子耳朵）、消失咒（让对象完全消失）、和召唤咒（让对象凭空产生）。"
    },
    {
      "title": "黑魔法防御术",
      "content": "黑魔法防御术是一门教学生学习防御型魔法、使他们免受黑魔法和黑暗生物伤害的科目"
    },
    {
      "title": "魔咒学",
      "content": "魔咒是符咒的一种，可以赋予对象新的或者额外的属性，而这门课的主要内容就是学习这一类符咒。魔咒学的课堂上是出了名的嘈杂和混乱，因为这门课需要大量的实践与练习。魔咒课的教室位于霍格沃茨城堡的三楼。"
    },
    {
      "title": "魔药学",
      "content": "魔药学是一门学习制造有魔法效果的混合物的科目。要想正确地制作出魔药，必须正确地混合配料，按照要求搅拌，并把握好合适的时间和适宜的温度"
    },
    {
      "title": "天文学",
      "content": "天文学是霍格沃茨所有科目中唯一一门与麻瓜世界中的学科完全相同的科目。天文课在天文塔上进行，这里是霍格沃茨城堡最高的塔楼。课程的内容包括使用望远镜观测夜空。天文课每周在午夜时进行，一年级的学生则在星期三上这门课。学生需要学习的内容包括行星、恒星和星座的名称，以及它们的位置、轨道和环境。"
    },
    {
      "title": "算数占卜",
      "content": "算数占卜是一门研究数字魔法属性的学科。由于哈利和罗恩都没有上这门课，因此关于这门课的信息并不多。不过，算术占卜是赫敏最喜欢的课。算数占卜应当非常难学，因为它要求记忆或使用大量的图表。"
    },
    {
      "title": "古代如尼文研究",
      "content": "古代如尼文研究是一门研究古代如尼文魔法文稿的理论课程。由于只有赫敏选了这门课，因此关于这门课的信息并不多。"
    },
    {
      "title": "魔法史",
      "content": "魔法史是一门关于魔法世界历史的科目。卡思伯特·宾斯的魔法史被认为是霍格沃茨里最枯燥乏味的课程，因为宾斯教授只会用单调乏味的声音不停地讲。这门课中介绍的内容包括妖精叛乱、巨人战争、《国际保密法》的起源等。这门课也是霍格沃茨里惟一由幽灵教授的课程，因为宾斯教授没注意到自己死了，还是继续讲课，就像什么都没有发生过"
    },
    {
      "title": "草药学",
      "content": "草药学是一门了解魔法植物，并学习如何照料、利用它们，并防止被它们伤害的学科。这门课在霍格沃茨城堡外面的温室进行。霍格沃茨至少有三个温室，这里面种植着危险程度各异的魔法植物。"
    },
    {
      "title": "占卜学",
      "content": "占卜术是用来预测未来的一个魔法分支。占卜有多种方法和手段，包括茶叶、火焰预兆、水晶球、手相、纸牌占卜（包括解读传统的扑克牌和塔罗牌）、占星术和解梦。"
    },
    {
      "title": "保护神奇生物",
      "content": "保护神奇生物是一门指导学生如何照料神奇动物的课程。这门课在城堡外边进行。"
    },
    {
      "title": "麻瓜研究",
      "content": "麻瓜研究是一门从“巫师的角度”研究麻瓜的课程。男女巫师了解麻瓜行事方法的唯一目的，是确保他们在需要的时候能够融入其中（比如在1994年魁地奇世界杯期间）。"
    },
    {
      "title": "幻影显形课",
      "content": "幻影显形是魔法世界中长途旅行的一种方式。六年级或者七年级的学生可以选择参加这门课程。在魔法世界中，使用幻影显形需要获得许可，并且只有十七岁以上的巫师才被允许幻影显形。进行这种限制的理由是幻影显形存在一定的危险性：注意力不集中可能导致身体的一部分留在原地，造成称为分体的副作用。"
    }
  ]
}